package ru.vanjo.qa.uiautotestsstarter.helpers.testdata;

import ru.vanjo.qa.uiautotestsstarter.common.Configuration;
import ru.vanjo.qa.uiautotestsstarter.helpers.testdata.models.Customer;

import java.util.Random;

public class CustomerGenerator {
    private final static String[] FIRST_NAMES = { "Александр", "Алексей", "Альберт", "Анатолий", "Андрей", "Антон", "Аркадий", "Арсений", "Артём", "Борис", "Вадим", "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Вячеслав", "Геннадий", "Георгий", "Герман", "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений", "Егор", "Иван", "Игнатий", "Игорь", "Илья", "Константин", "Лаврентий", "Леонид", "Лука", "Макар", "Максим", "Матвей", "Михаил", "Никита", "Николай", "Олег", "Роман", "Семён", "Сергей", "Станислав", "Степан", "Фёдор", "Эдуард", "Юрий", "Ярослав" };
    private final static String[] LAST_NAMES = { "Смирнов", "Иванов", "Кузнецов", "Попов", "Соколов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров", "Волков", "Соловьев", "Васильев", "Зайцев", "Павлов", "Семенов", "Голубев", "Виноградов", "Богданов", "Воробьев", "Федоров", "Михайлов", "Беляев", "Тарасов", "Белов", "Комаров", "Орлов", "Киселев", "Макаров", "Андреев", "Ковалев", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королев", "Герасимов", "Пономарев", "Григорьев", "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлев", "Николаев", "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков", "Тихонов", "Аксенов", "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов", "Овчинников", "Селезнев", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов", "Лукин", "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов", "Наумов", "Шилов", "Воронцов", "Ермаков", "Дроздов", "Игнатьев", "Савин", "Логинов", "Сафонов", "Капустин", "Кириллов", "Моисеев", "Елисеев", "Кошелев", "Костин", "Горбачев", "Орехов", "Ефремов", "Исаев", "Евдокимов", "Калашников", "Кабанов", "Носков", "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров", "Харитонов", "Агафонов", "Муравьев", "Ларионов", "Федосеев", "Зимин", "Пахомов", "Шубин", "Игнатов", "Филатов", "Крюков", "Рогов", "Кулаков", "Терентьев", "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев", "Гришин", "Кононов", "Дементьев", "Ситников", "Симонов", "Мишин", "Фадеев", "Комиссаров", "Мамонтов", "Носов", "Гуляев", "Шаров", "Устинов", "Вишняков", "Евсеев", "Лаврентьев", "Брагин", "Константинов", "Корнилов", "Авдеев", "Зыков", "Бирюков", "Шарапов", "Никонов", "Щукин", "Дьячков", "Одинцов", "Сазонов", "Якушев", "Красильников", "Гордеев", "Самойлов", "Князев", "Беспалов", "Уваров", "Шашков", "Бобылев", "Доронин", "Белозеров", "Рожков", "Самсонов", "Мясников", "Лихачев", "Буров", "Сысоев", "Фомичев", "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов", "Субботин", "Фокин", "Блохин", "Селиверстов", "Пестов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров" };
    private final static String[] MIDDLE_NAMES = { "Александрович", "Алексеевич", "Альбертович", "Анатольевич", "Андреевич", "Антонович", "Аркадьевич", "Арсеньевич", "Артёмович", "Борисович", "Вадимович", "Валентинович", "Валерьевич", "Васильевич", "Викторович", "Витальевич", "Владимирович", "Владиславович", "Вячеславович", "Геннадьевич", "Георгиевич", "Германович", "Григорьевич", "Даниилович", "Денисович", "Дмитриевич", "Евгеньевич", "Егорович", "Иванович", "Игнатьевич", "Игоревич", "Ильич", "Константинович", "Лаврентьевич", "Леонидович", "Лукич", "Макарович", "Максимович", "Матвеевич", "Михайлович", "Никитич", "Николаевич", "Олегович", "Романович", "Семёнович", "Сергеевич", "Станиславович", "Степанович", "Фёдорович", "Эдуардович", "Юрьевич", "Ярославович" };
    private final static String[] STREETS = { "Советская", "Молодежная", "Центральная", "Школьная", "Новая", "Садовая", "Лесная", "Набережная", "Ленина", "Мира", "Октябрьская", "Зеленая", "Комсомольская", "Заречная", "Первомайская", "Гагарина", "Полевая", "Луговая", "Пионерская", "Кирова", "Юбилейная", "Северная", "Пролетарская", "Степная", "Пушкина", "Калинина", "Южная", "Колхозная", "Рабочая", "Солнечная", "Железнодорожная", "Восточная", "Заводская", "Чапаева", "Нагорная", "Строителей", "Береговая", "Победы", "Горького", "Кооперативная", "Красноармейская", "Совхозная", "Речная", "Школьный ", "Спортивная", "Озерная", "Строительная", "Парковая", "Чкалова", "Мичурина", "Подгорная", "Дружбы", "Почтовая", "Партизанская", "Вокзальная", "Лермонтова", "Свободы", "Дорожная", "Дачная", "Маяковского", "Западная", "Фрунзе", "Дзержинского", "Московская", "Свердлова", "Некрасова", "Гоголя", "Красная", "Трудовая", "Шоссейная", "Чехова", "Коммунистическая", "Труда", "Комарова", "Матросова", "Островского", "Сосновая", "Клубная", "Куйбышева", "Крупской", "Березовая", "Карла Маркса", "8 Марта", "Больничная", "Садовый ", "Интернациональная", "Суворова", "Цветочная", "Трактовая", "Ломоносова", "Горная", "Космонавтов", "Энергетиков", "Шевченко", "Весенняя", "Механизаторов", "Коммунальная", "Лесной ", "40 лет Победы", "Майская" };
    private final static String[] CITIES = { "Москва", "Владимир", "Санкт-Петербург", "Новосибирск", "Екатеринбург", "Нижний Новгород", "Самара", "Казань", "Омск", "Челябинск", "Ростов-на-Дону", "Уфа", "Волгоград", "Пермь", "Красноярск", "Воронеж", "Саратов", "Краснодар", "Тольятти", "Ижевск", "Барнаул", "Ульяновск", "Тюмень", "Иркутск", "Владивосток", "Ярославль", "Хабаровск", "Махачкала", "Оренбург", "Новокузнецк", "Томск", "Кемерово", "Рязань", "Астрахань", "Пенза", "Липецк", "Тула", "Киров", "Чебоксары", "Курск", "Брянск", "Магнитогорск", "Иваново", "Тверь", "Ставрополь", "Белгород", "Сочи" };

    private final static Random RANDOM = new Random();

    public static Customer generateCustomer() {
        return new Customer(
                FIRST_NAMES[RANDOM.nextInt(FIRST_NAMES.length)],
                LAST_NAMES[RANDOM.nextInt(LAST_NAMES.length)],
                MIDDLE_NAMES[RANDOM.nextInt(MIDDLE_NAMES.length)],
                STREETS[RANDOM.nextInt(STREETS.length)],
                CITIES[RANDOM.nextInt(CITIES.length)],
                generateEmail(),
                generatePhone()
        );
    }

    private static String generateEmail() {
        var originalEmail = Configuration.instance().getConfig().getString("testdata.email");
        var emailsParts = originalEmail.split("@");
        return emailsParts[0] + "+" + RANDOM.nextInt(1000000) + "@" + emailsParts[1];
    }

    private static String generatePhone() {
        return "7111111" + (RANDOM.nextInt(8999) + 1000);
    }
}
